In [7]:
import openai

import itertools
import pandas as pd
import random
import os
import csv

from openai import OpenAI

In [2]:
domains = {
    'healthcare': 'Comprehensive data on patient demographics, medical histories, treatment protocols, and outcomes; drug efficacy studies and side effects.',
    'technology': 'Data on emerging technologies, market trends, innovation, and technological disruptions across various industries.',
    'hospitality': 'Information on travel and tourism trends, customer preferences, hotel management, and global hospitality analysis.',
    'environment': 'Data related to climate change, environmental conservation efforts, biodiversity, and sustainable development initiatives.',
    'entertainment': 'Records on media consumption patterns, content creation, audience engagement, and entertainment industry revenue streams.',
    'automotive': 'Detailed information on vehicle sales, automotive technologies, sustainable transportation, and global automotive market analysis.',
    'agriculture': 'Data on crop yields, farming practices, agricultural supply chain, and global food security initiatives.',
    'government': 'Comprehensive records on public policy, legislative processes, government spending, citizen demographics, and governance effectiveness.',
    'fashion': 'Information on fashion trends, consumer behavior, sustainable fashion practices, and global fashion industry analysis.',
    'sports': 'Detailed data on sports events, athlete performance, fan engagement, sports industry economics, and global sports market trends.'
}

user_proficiencies = {
    "beginner",
    "intermediate",
    "advanced",
    "expert"
}

sql_complexity = {
    "basic SQL with a simple select statement",
    "only one join (specify inner, outer, cross)",
    "two or more joins (specify inner, outer, cross)",
    "subqueries, including correlated and nested subqueries",
    "common table expressions",
    "aggregation functions (COUNT, SUM, AVG, MIN, MAX, etc.), and HAVING clause",
    "set operations such as UNION, INTERSECT, and EXCEPT",
    "window functions (e.g., ROW_NUMBER, LEAD, LAG, RANK, NTILE, PERCENT_RANK, etc.)",
    "pivoting and unpivoting"
}

sql_task = {
    "data definition: creating, altering, or dropping tables and other database objects",
    "data retrieval: basic data fetching queries",
    "data manipulation: inserting, updating, or deleting records",
    "analytics and reporting: generating reports, dashboards, and analytical insights",
    "transactional processing: SQL transaction control statements (e.g., BEGIN, COMMIT, ROLLBACK)"
}

In [3]:
# Generating the cartesian product
combinations = list(itertools.product(domains.keys(), user_proficiencies, sql_complexity, sql_task))
random.shuffle(combinations)

# Sampling 100 combinations
sampled_combinations = combinations[:1000]

# Creating a dataframe
df = pd.DataFrame(sampled_combinations, columns=['domain', 'user_proficiency', 'sql_complexity', 'sql_task'])

# Adding the descriptions
df['domain_description'] = df['domain'].map(domains)

In [4]:
df.head()

,domain,user_proficiency,sql_complexity,sql_task,domain_description
0,government,advanced,common table expressions,"data manipulation: inserting, updating, or del...","Comprehensive records on public policy, legisl..."
1,automotive,intermediate,"aggregation functions (COUNT, SUM, AVG, MIN, M...",transactional processing: SQL transaction cont...,"Detailed information on vehicle sales, automot..."
2,entertainment,beginner,basic SQL with a simple select statement,"data manipulation: inserting, updating, or del...","Records on media consumption patterns, content..."
3,government,expert,"subqueries, including correlated and nested su...","analytics and reporting: generating reports, d...","Comprehensive records on public policy, legisl..."
4,fashion,expert,"set operations such as UNION, INTERSECT, and E...",data retrieval: basic data fetching queries,"Information on fashion trends, consumer behavi..."

In [5]:
def get_prompt(domain: str, data_description: str, user_level: str, sql_complexity: str, sql_task: str, verbose=False) -> str:
    prompt = f"""
    ###### GUIDELINES
    Create 1 comma delimited row with following specifications. Exclude headers and just give me csv. Do not include ```csv ``` in response, just want the raw text in csv format.
    Please wrap each value in double quotes.

    example row:
    "Create a table that stores the average fuel efficiency for different vehicle models across various regions, and then display the top 5 most fuel-efficient models.","CREATE TABLE FuelEfficiency (ModelID INT PRIMARY KEY, ModelName VARCHAR(50), Region VARCHAR(50), AvgFuelEfficiency DECIMAL); INSERT INTO FuelEfficiency (ModelID, ModelName, Region, AvgFuelEfficiency) VALUES (1, 'Model S', 'North America', 120.5), (2, 'Model 3', 'Europe', 118.0), (3, 'Leaf', 'Asia', 110.0), (4, 'Bolt', 'North America', 115.7), (5, 'Prius', 'Europe', 95.0);", "WITH RankedModels AS (SELECT ModelName, AvgFuelEfficiency, DENSE_RANK() OVER (ORDER BY AvgFuelEfficiency DESC) AS Rank FROM FuelEfficiency) SELECT ModelName, AvgFuelEfficiency FROM RankedModels WHERE Rank <= 5;","The query creates a common table expression (CTE) to rank vehicle models based on their average fuel efficiency in descending order. It then selects the top 5 most fuel-efficient models using the DENSE_RANK function."    
    
    Column 1: natural language prompt
    * column name: prompt
    * a well-formulated question or command in everyday English, representing a user query to a database
    * prompt should require using {user_level} level of SQL and ideally {sql_complexity}
    * prompt should be in the {domain} domain and pertain to {data_description}
    * prompt should pertain to {sql_task} first and foremost

    Column 2: tables and views that already exist in the database
    * column name: context
    * this should be database context, NOT the SQL query representing a user’s prompt
    * include complete executable SQL table CREATE statements and/or view CREATE statements with capitalized keywords
    * only table CREATE and CREATE + INSERT statements are allowed as database context. No ALTER/DROP/UPDATE
    * provide up to five tables/views that are relevant to the user’s natural language prompt
    * provide only the SQL code for create statements, separated by a semicolon
    * make sure there is no text preceding or following SQL code
    * do not use newline characters or breakline tags in SQL code
    * do not use ellipsis anywhere: this should be a valid, executable SQL statement
    * do not use phrases like “same as previous example”
    * table names and schemas should correspond to the {domain} domain and focus on {data_description}
    * make sure there is no text of any kind preceding or following SQL code

    Column 3: SQL query
    * column name: sql
    * A complete and executable SQL query used to answer/execute the natural language prompt
    * do not use ellipsis anywhere: this should be a valid, executable SQL statement
    * SQL should be based on the database context generated above
    * To the extent possible, SQL should leverage {sql_complexity}
    * SQL should be written at an {user_level} SQL proficiency level
    * do not use newline characters or breakline tags in SQL code
    * make sure there is no text of any kind preceding or following SQL code

    Column 4: explanation
    * column name: explanation
    * a step-by-step explanation of what the SQL query is doing
    """
    return prompt

In [8]:
client = OpenAI(
    # This is the default and can be omitted
    api_key='TOKEN HERE',
)

In [ ]:
# def validate_csv_response(response_text: str, num_columns: int=4) -> list:
#     rows = response_text.strip().split('\n')
#     valid_rows = []
#     for row in rows:
#         try:
#             parsed_row = [r for r in csv.reader([row])]
#             if len(parsed_row) == 1 and len(parsed_row[0]) == num_columns:
#                 valid_rows.append(parsed_row[0])
#         except Exception as e:
#             continue
#     return valid_rows

# # Helper function to write rows to CSV
# def write_rows_to_csv(rows: list, file_path: str):
#     with open(file_path, mode='a', newline='') as file:
#         writer = csv.writer(file)
#         for row in rows:
#             writer.writerow(row)

# output_csv = 'gpt-data_1k.csv'
# headers = ["domain", "domain_description", "user_proficiency", "sql_complexity", "sql_task", "sql_prompt", "sql_context", "sql", "sql_explanation"]
# if not os.path.exists(output_csv):
#     with open(output_csv, mode='w', newline='') as file:
#         writer = csv.writer(file)
#         writer.writerow(headers)

# index = 0
# rows_written = 0
# max_rows = 1000
# num_columns = len(headers)

# df_shuffled = df.sample(frac=1).reset_index(drop=True)
# while rows_written < max_rows and index < len(df_shuffled):
#     row = df_shuffled.iloc[index]
#     domain = row['domain']
#     data_description = row['domain_description']
#     user_level = row['user_proficiency']
#     sql_complexity = row['sql_complexity']
#     sql_task = row['sql_task']
    
#     prompt = get_prompt(domain, data_description, user_level, sql_complexity, sql_task)
    
#     response = client.chat.completions.create(
#         model="gpt-4o",
#         messages=[
#             {"role": "system", "content": "You are a data and SQL expert specializing in generating synthetic data."},
#             {"role": "user", "content": prompt}
#         ],
#         temperature=0.8,
#     )

    
#     response_text = response.choices[0].message.content.strip()
    
#     valid_rows = validate_csv_response(response_text)
    
#     if valid_rows:
#         rows_to_write = min(len(valid_rows), max_rows - rows_written)
#         for valid_row in valid_rows[:rows_to_write]:
#             complete_row = [domain, data_description, user_level, sql_complexity, sql_task] + valid_row 
#             write_rows_to_csv([complete_row], output_csv)
#             rows_written += 1

#     print(f"Rows Written: {rows_written}")
#     print(f"Index: {index}")
#     print("="*20)
#     index += 1

In [ ]:
import os
import csv
import random
import time
from concurrent.futures import ThreadPoolExecutor, as_completed

def validate_csv_response(response_text: str, num_columns: int=4) -> list:
    rows = response_text.strip().split('\n')
    valid_rows = []
    for row in rows:
        try:
            parsed_row = [r for r in csv.reader([row])]
            if len(parsed_row) == 1 and len(parsed_row[0]) == num_columns:
                valid_rows.append(parsed_row[0])
        except Exception as e:
            continue
    return valid_rows

# Helper function to write rows to CSV
def write_rows_to_csv(rows: list, file_path: str):
    with open(file_path, mode='a', newline='') as file:
        writer = csv.writer(file)
        for row in rows:
            writer.writerow(row)

# Function to handle each row
def process_row(row, client, output_csv, max_rows, max_retries=2):
    retries = 0
    while retries <= max_retries:
        try:
            # Random initial sleep to space out requests
            time.sleep(random.uniform(3, 10))

            domain = row['domain']
            data_description = row['domain_description']
            user_level = row['user_proficiency']
            sql_complexity = row['sql_complexity']
            sql_task = row['sql_task']
            
            prompt = get_prompt(domain, data_description, user_level, sql_complexity, sql_task)
            
            response = client.chat.completions.create(
                model="gpt-4o",
                messages=[
                    {"role": "system", "content": "You are a data and SQL expert specializing in generating synthetic data."},
                    {"role": "user", "content": prompt}
                ],
                temperature=0.8,
            )

            response_text = response.choices[0].message.content.strip()
            
            valid_rows = validate_csv_response(response_text)
            
            written_rows = 0
            if valid_rows:
                rows_to_write = min(len(valid_rows), max_rows)
                complete_rows = [[domain, data_description, user_level, sql_complexity, sql_task] + valid_row for valid_row in valid_rows[:rows_to_write]]
                write_rows_to_csv(complete_rows, output_csv)
                written_rows = len(complete_rows)

            return written_rows

        except Exception as e:
            if '429' in str(e) and retries < max_retries:
                retries += 1
                wait_time = random.uniform(3, 10)
                print(f"Retrying {retries}/{max_retries} after {wait_time:.2f} seconds due to 429 error...")
                time.sleep(wait_time)
            else:
                return f"error generating: {e}"

output_csv = 'gpt-data_1k.csv'
headers = ["domain", "domain_description", "user_proficiency", "sql_complexity", "sql_task", "sql_prompt", "sql_context", "sql", "sql_explanation"]
if not os.path.exists(output_csv):
    with open(output_csv, mode='w', newline='') as file:
        writer = csv.writer(file)
        writer.writerow(headers)

rows_written = 0
max_rows = 1000
num_columns = len(headers)

df_shuffled = df.sample(frac=1).reset_index(drop=True)

with ThreadPoolExecutor(max_workers=4) as executor:
    futures = []
    for index, row in df_shuffled.iterrows():
        if rows_written >= max_rows:
            break
        futures.append(executor.submit(process_row, row, client, output_csv, max_rows - rows_written))
    
    for future in as_completed(futures):
        try:
            written_rows = future.result()
            rows_written += written_rows
        except Exception as e:
            print(f"Error processing row: {e}")
        
        print(f"Rows Written: {rows_written}")
        print("="*20)

print(f"Total Rows Written: {rows_written}")

In [58]:
# Load Model

In [1]:
import csv
import yaml
from typing import Tuple
import re
from functools import partial

from datasets import load_dataset
from transformers import AutoTokenizer, BitsAndBytesConfig, GenerationConfig
from peft import AutoPeftModelForCausalLM
import torch

from llmtune.pydantic_models.config_model import Config

In [2]:
EXPERIMENT_HASH = "CmWSJ"
config_path = f"./experiment/{EXPERIMENT_HASH}/config/config.yml"

with open(config_path, "r") as f:
    config = yaml.safe_load(f)
    config = Config(**config)

In [3]:
weights_path = f"./experiment/{EXPERIMENT_HASH}/weights/"
model = AutoPeftModelForCausalLM.from_pretrained(
    weights_path,
    torch_dtype=torch.bfloat16,
    device_map="auto",
    attn_implementation="flash_attention_2",
)
model = model.merge_and_unload()
tok = AutoTokenizer.from_pretrained(weights_path, device_map="auto")

/home/zeus/miniconda3/envs/cloudspace/lib/python3.10/site-packages/huggingface_hub/file_download.py:1132: FutureWarning: `resume_download` is deprecated and will be removed in version 1.0.0. Downloads always resume when possible. If you want to force a new download, use `force_download=True`.
  warnings.warn(

Loading checkpoint shards:   0%|          | 0/3 [00:00<?, ?it/s]

You set `add_prefix_space`. The tokenizer needs to be converted from the slow tokenizers

In [4]:
def infer(prompt: str, model, tok: AutoTokenizer) -> str:
    """
    Outputs predicted sequence and probability
    """
    input_ids = tok.encode(prompt, return_tensors="pt", truncation=True).cuda()
    gen_config = GenerationConfig(
        max_new_tokens=1024,
        do_sample=True,
        temperature=0.2,
        pad_token_id=tok.pad_token_id,
        return_dict_in_generate=True,
        output_scores=True,
        )

    gen_results = model.generate(input_ids, gen_config)
    gen_tok_ids = gen_results.sequences.squeeze(0)[input_ids.shape[1]:]

    seq = tok.decode(gen_tok_ids, skip_special_tokens=True)

    seq_score = torch.stack(gen_results.scores).squeeze(1) # get raw output scores 
    seq_score = torch.log(torch.softmax(seq_score, dim=1)) # softmax and log to get log_prob
    seq_score = seq_score.gather(dim=1, index=gen_tok_ids.view(-1, 1)).squeeze()
    seq_score = torch.exp(torch.sum(seq_score)).item() # sum and exp to get prob

    return seq, seq_score

In [5]:
with open("prompts.csv", mode='r', newline='') as file:
    reader = csv.reader(file)
    headers = next(reader)  # Read the header
    data = [tuple(row) for row in reader]  # Read the data and convert each row to a tuple

processed_preds = {}
for idx, row in enumerate(data):
    out, _ = infer(row[1], model, tok)
    out = out.strip()
    out += f"\t----- bird -----\t{data[idx][0]}"
    processed_preds[str(idx)] = out
    print(f"Done {idx+1}/{len(data)}")

Asking to truncate to max_length but no maximum length is provided and the model has no predefined maximum length. Default to no truncation.

Done 1/500
Done 2/500
Done 3/500
Done 4/500
Done 5/500
Done 6/500
Done 7/500
Done 8/500
Done 9/500
Done 10/500
Done 11/500
Done 12/500
Done 13/500
Done 14/500
Done 15/500
Done 16/500
Done 17/500
Done 18/500
Done 19/500
Done 20/500
Done 21/500
Done 22/500
Done 23/500
Done 24/500
Done 25/500
Done 26/500
Done 27/500
Done 28/500
Done 29/500
Done 30/500
Done 31/500
Done 32/500
Done 33/500
Done 34/500
Done 35/500
Done 36/500
Done 37/500
Done 38/500
Done 39/500
Done 40/500
Done 41/500
Done 42/500
Done 43/500
Done 44/500
Done 45/500
Done 46/500
Done 47/500
Done 48/500
Done 49/500
Done 50/500
Done 51/500
Done 52/500
Done 53/500
Done 54/500
Done 55/500
Done 56/500
Done 57/500
Done 58/500
Done 59/500
Done 60/500
Done 61/500
Done 62/500
Done 63/500
Done 64/500
Done 65/500
Done 66/500
Done 67/500
Done 68/500
Done 69/500
Done 70/500
Done 71/500
Done 72/500
Done 73/500
Done 74/500
Done 75/500
Done 76/500
Done 77/500
Done 78/500
Done 79/500
Done 80/500
Done 81/500
Done 82/500
Done 83/500
Done 84/500
Done 85/500
Done 86/500
Done 87/500
Done 88/500
Done 89/500
Done 90/500
Done 91/500
Done 92/500
Done 93/500
Done 94/500
Done 95/500
Done 96/500
Done 97/500
Done 98/500
Done 99/500
Done 100/500
Done 101/500
Done 102/500
Done 103/500
Done 104/500
Done 105/500
Done 106/500
Done 107/500
Done 108/500
Done 109/500
Done 110/500
Done 111/500
Done 112/500
Done 113/500
Done 114/500
Done 115/500
Done 116/500
Done 117/500
Done 118/500
Done 119/500
Done 120/500
Done 121/500
Done 122/500
Done 123/500
Done 124/500
Done 125/500
Done 126/500
Done 127/500
Done 128/500
Done 129/500
Done 130/500
Done 131/500
Done 132/500
Done 133/500
Done 134/500
Done 135/500
Done 136/500
Done 137/500
Done 138/500
Done 139/500
Done 140/500
Done 141/500
Done 142/500
Done 143/500
Done 144/500
Done 145/500
Done 146/500
Done 147/500
Done 148/500
Done 149/500
Done 150/500
Done 151/500
Done 152/500
Done 153/500
Done 154/500
Done 155/500
Done 156/500
Done 157/500
Done 158/500
Done 159/500
Done 160/500
Done 161/500
Done 162/500
Done 163/500
Done 164/500
Done 165/500
Done 166/500
Done 167/500
Done 168/500
Done 169/500
Done 170/500
Done 171/500
Done 172/500
Done 173/500
Done 174/500
Done 175/500
Done 176/500
Done 177/500
Done 178/500
Done 179/500
Done 180/500
Done 181/500
Done 182/500
Done 183/500
Done 184/500
Done 185/500
Done 186/500
Done 187/500
Done 188/500
Done 189/500
Done 190/500
Done 191/500
Done 192/500
Done 193/500
Done 194/500
Done 195/500
Done 196/500
Done 197/500
Done 198/500
Done 199/500
Done 200/500
Done 201/500
Done 202/500
Done 203/500
Done 204/500
Done 205/500
Done 206/500
Done 207/500
Done 208/500
Done 209/500
Done 210/500
Done 211/500
Done 212/500
Done 213/500
Done 214/500
Done 215/500
Done 216/500
Done 217/500
Done 218/500
Done 219/500
Done 220/500
Done 221/500
Done 222/500
Done 223/500
Done 224/500
Done 225/500
Done 226/500
Done 227/500
Done 228/500
Done 229/500
Done 230/500
Done 231/500
Done 232/500
Done 233/500
Done 234/500
Done 235/500
Done 236/500
Done 237/500
Done 238/500
Done 239/500
Done 240/500
Done 241/500
Done 242/500
Done 243/500
Done 244/500
Done 245/500
Done 246/500
Done 247/500
Done 248/500
Done 249/500
Done 250/500
Done 251/500
Done 252/500
Done 253/500
Done 254/500
Done 255/500
Done 256/500
Done 257/500
Done 258/500
Done 259/500
Done 260/500
Done 261/500
Done 262/500
Done 263/500
Done 264/500
Done 265/500
Done 266/500
Done 267/500
Done 268/500
Done 269/500
Done 270/500
Done 271/500
Done 272/500
Done 273/500
Done 274/500
Done 275/500
Done 276/500
Done 277/500
Done 278/500
Done 279/500
Done 280/500
Done 281/500
Done 282/500
Done 283/500
Done 284/500
Done 285/500
Done 286/500
Done 287/500
Done 288/500
Done 289/500
Done 290/500
Done 291/500
Done 292/500
Done 293/500
Done 294/500
Done 295/500
Done 296/500
Done 297/500
Done 298/500
Done 299/500
Done 300/500
Done 301/500
Done 302/500
Done 303/500
Done 304/500
Done 305/500
Done 306/500
Done 307/500
Done 308/500
Done 309/500
Done 310/500
Done 311/500
Done 312/500
Done 313/500
Done 314/500
Done 315/500
Done 316/500
Done 317/500
Done 318/500
Done 319/500
Done 320/500
Done 321/500
Done 322/500
Done 323/500
Done 324/500
Done 325/500
Done 326/500
Done 327/500
Done 328/500
Done 329/500
Done 330/500
Done 331/500
Done 332/500
Done 333/500
Done 334/500
Done 335/500
Done 336/500
Done 337/500
Done 338/500
Done 339/500
Done 340/500
Done 341/500
Done 342/500
Done 343/500
Done 344/500
Done 345/500
Done 346/500
Done 347/500
Done 348/500
Done 349/500
Done 350/500
Done 351/500
Done 352/500
Done 353/500
Done 354/500
Done 355/500
Done 356/500
Done 357/500
Done 358/500
Done 359/500
Done 360/500
Done 361/500
Done 362/500
Done 363/500
Done 364/500
Done 365/500
Done 366/500
Done 367/500
Done 368/500
Done 369/500
Done 370/500
Done 371/500
Done 372/500
Done 373/500
Done 374/500
Done 375/500
Done 376/500
Done 377/500
Done 378/500
Done 379/500
Done 380/500
Done 381/500
Done 382/500
Done 383/500
Done 384/500
Done 385/500
Done 386/500
Done 387/500
Done 388/500
Done 389/500
Done 390/500
Done 391/500
Done 392/500
Done 393/500
Done 394/500
Done 395/500
Done 396/500
Done 397/500
Done 398/500
Done 399/500
Done 400/500
Done 401/500
Done 402/500
Done 403/500
Done 404/500
Done 405/500
Done 406/500
Done 407/500
Done 408/500
Done 409/500
Done 410/500
Done 411/500
Done 412/500
Done 413/500
Done 414/500
Done 415/500
Done 416/500
Done 417/500
Done 418/500
Done 419/500
Done 420/500
Done 421/500
Done 422/500
Done 423/500
Done 424/500
Done 425/500
Done 426/500
Done 427/500
Done 428/500
Done 429/500
Done 430/500
Done 431/500
Done 432/500
Done 433/500
Done 434/500
Done 435/500
Done 436/500
Done 437/500
Done 438/500
Done 439/500
Done 440/500
Done 441/500
Done 442/500
Done 443/500
Done 444/500
Done 445/500
Done 446/500
Done 447/500
Done 448/500
Done 449/500
Done 450/500
Done 451/500
Done 452/500
Done 453/500
Done 454/500
Done 455/500
Done 456/500
Done 457/500
Done 458/500
Done 459/500
Done 460/500
Done 461/500
Done 462/500
Done 463/500
Done 464/500
Done 465/500
Done 466/500
Done 467/500
Done 468/500
Done 469/500
Done 470/500
Done 471/500
Done 472/500
Done 473/500
Done 474/500
Done 475/500
Done 476/500
Done 477/500
Done 478/500
Done 479/500
Done 480/500
Done 481/500
Done 482/500
Done 483/500
Done 484/500
Done 485/500
Done 486/500
Done 487/500
Done 488/500
Done 489/500
Done 490/500
Done 491/500
Done 492/500
Done 493/500
Done 494/500
Done 495/500
Done 496/500
Done 497/500
Done 498/500
Done 499/500
Done 500/500

In [6]:
import json
with open("predict_mini_dev_mistral-gpt_SQLite.json", 'w') as json_file:
    json.dump(processed_preds, json_file, indent=4)

In [7]:
processed_preds

{'0': "SELECT COUNT(*) FROM customers WHERE Currency = 'EUR' / COUNT(*) FROM customers WHERE Currency = 'CZK';\t----- bird -----\tdebit_card_specializing",
 '1': "WITH RankedCustomers AS (SELECT CustomerID, Consumption, DENSE_RANK() OVER (ORDER BY Consumption) AS Rank FROM yearmonth WHERE Date = '2012-01-01' AND Segment = 'LAM') SELECT CustomerID FROM RankedCustomers WHERE Rank = 1;\t----- bird -----\tdebit_card_specializing",
 '2': "SELECT AVG(Consumption) AS AvgConsumption FROM yearmonth WHERE CustomerID IN (SELECT CustomerID FROM customers WHERE Segment = 'SME') AND YEAR(Date) = 2013 AND MONTH(Date) BETWEEN 1 AND 12;\t----- bird -----\tdebit_card_specializing",
 '3': "SELECT SUM(CASE WHEN customers.Currency = 'CZK' THEN transactions_1k.Amount ELSE 0 END) - SUM(CASE WHEN customers.Currency = 'EUR' THEN transactions_1k.Amount ELSE 0 END) AS Difference FROM customers INNER JOIN transactions_1k ON customers.CustomerID = transactions_1k.CustomerID WHERE YEAR(transactions_1k.Date) = 2012;\t----- bird -----\tdebit_card_specializing",
 '4': "WITH YearlyConsumption AS (SELECT YEAR(Date) AS Year, SUM(Consumption) AS TotalConsumption FROM yearmonth GROUP BY YEAR) SELECT Year, TotalConsumption FROM YearlyConsumption WHERE Country = 'CZK' ORDER BY TotalConsumption DESC LIMIT 1;\t----- bird -----\tdebit_card_specializing",
 '5': "WITH RankedMonths AS (SELECT Date, Consumption, DENSE_RANK() OVER (PARTITION BY CustomerID ORDER BY Consumption DESC) AS Rank FROM yearmonth WHERE Year = 2013 AND Segment = 'SME') SELECT Date FROM RankedMonths WHERE Rank = 1;\t----- bird -----\tdebit_card_specializing",
 '6': "WITH RankedCustomers AS (SELECT CustomerID, Segment, SUM(Consumption) AS TotalConsumption FROM yearmonth WHERE Date BETWEEN '2013-01-01' AND '2013-12-31' GROUP BY CustomerID, Segment ORDER BY TotalConsumption ASC) SELECT RankedCustomers.Segment, RankedCustomers.TotalConsumption, (SELECT TotalConsumption FROM RankedCustomers WHERE Segment = 'SME' AND CustomerID != RankedCustomers.CustomerID) AS SME, (SELECT TotalConsumption FROM RankedCustomers WHERE Segment = 'LAM' AND CustomerID != RankedCustomers.CustomerID) AS LAM, (SELECT TotalConsumption FROM RankedCustomers WHERE Segment = 'KAM' AND CustomerID != RankedCustomers.CustomerID) AS KAM FROM RankedCustomers;\t----- bird -----\tdebit_card_specializing",
 '7': "WITH SegmentConsumption AS (SELECT Segment, SUM(Consumption) AS TotalConsumption FROM yearmonth GROUP BY Segment), SegmentIncrease AS (SELECT Segment, (SUM(Consumption) - LAG(SUM(Consumption)) OVER (PARTITION BY Segment ORDER BY Date)) AS Increase FROM yearmonth GROUP BY Segment) SELECT Segment, TotalConsumption, Increase, (Increase / LAG(TotalConsumption) OVER (PARTITION BY Segment ORDER BY Date)) * 100 AS PercentageIncrease FROM SegmentConsumption JOIN SegmentIncrease ON SegmentConsumption.Segment = SegmentIncrease.Segment WHERE Date BETWEEN '2012-01-01' AND '2013-12-31' ORDER BY PercentageIncrease DESC LIMIT 1; WITH SegmentConsumption AS (SELECT SegMENT, SUM(Consumption) AS TotalConsumption FROM yearmonth GROUP BY SegMENT), SegmentIncrease AS (SELECT Segment, (SUM(Consumption) - LAG(SUM(Consumption)) OVER (PARTITION BY Segment ORDER BY Date)) AS Increase FROM yearmonth GROUP BY Segment) SELECT Segment, TotalConsumption, Increase, (Increase / LAG(TotalConsumption) OVER (PARTITION BY Segment ORDER BY Date)) * 100 AS PercentageIncrease FROM SegmentConsumption JOIN SegmentIncrease ON SegmentConsumption.Segment = SegmentIncrease.Segment WHERE Date BETWEEN '2012-01-01' AND '2013-12-31' ORDER BY PercentageIncrease ASC LIMIT 1;\t----- bird -----\tdebit_card_specializing",
 '8': "SELECT SUM(Consumption) FROM yearmonth WHERE CustomerID = 6 AND Date BETWEEN '2013-08-01' AND '2013-11-30';\t----- bird -----\tdebit_card_specializing",
 '9': "SELECT COUNT(*) FROM gasstations WHERE Country = 'Czech Republic' AND Segment = 'discount' - COUNT(*) FROM gasstations WHERE Country = 'Slovakia' AND Segment = 'discount'\t----- bird -----\tdebit_card_specializing",
 '10': "WITH SME_Payments AS (SELECT COUNT(*) AS SME_Count FROM transactions_1k WHERE CustomerID IN (SELECT CustomerID FROM customers WHERE Segment = 'SME') AND Currency = 'CZK') SELECT SME_Count FROM SME_Payments WHERE SME_Count > (SELECT COUNT(*) FROM transactions_1k WHERE CustomerID IN (SELECT CustomerID FROM customers WHERE Segment = 'SME') AND Currency = 'EUR');\t----- bird -----\tdebit_card_specializing",
 '11': 'SELECT COUNT(DISTINCT c.CustomerID) AS TotalCustomers, COUNT(DISTINCT CASE WHEN c.Consumption > 46.73 THEN c.CustomerID END) AS CustomersConsumedMore FROM yearmonth ym INNER JOIN customers c ON ym.CustomerID = c.CustomerID GROUP BY c.Segment; WITH Percentage AS (SELECT COUNT(DISTINCT c.CustomerID) AS TotalCustomers, COUNT(DISTINCT CASE WHEN c.Consumption > 46.73 THEN c.CustomerID END) AS CustomersConsumedMore FROM yearmonth ym INNER JOIN customers c ON ym.CustomerID = c.CustomerID GROUP BY c.Segment) SELECT Segment, (CustomersConsumedMore * 100.0) / TotalCustomers AS Percentage FROM Percentage;\t----- bird -----\tdebit_card_specializing',
 '12': "WITH Consumption AS (SELECT CustomerID, COUNT(*) as Consumption FROM yearmonth WHERE Date = '2012-02-01' GROUP BY CustomerID) SELECT COUNT(*) AS TotalCustomers, COUNT(*) FILTER (WHERE Consumption > 528.3) AS CustomersConsumedMore FROM Consumption; WITH Percentage AS (SELECT COUNT(*) AS TotalCustomers, COUNT(*) FILTER (WHERE Consumption > 528.3) AS CustomersConsumedMore FROM Consumption) SELECT (CustomersConsumedMore * 100.0) / TotalCustomers AS Percentage FROM Percentage;\t----- bird -----\tdebit_card_specializing",
 '13': 'WITH RankedCustomers AS (SELECT CustomerID, Consumption, DENSE_RANK() OVER (PARTITION BY Date ORDER BY Consumption DESC) AS Rank FROM yearmonth WHERE YEAR(Date) = 2012) SELECT CustomerID, Consumption FROM RankedCustomers WHERE Rank = 1;\t----- bird -----\tdebit_card_specializing',
 '14': "SELECT p.Description FROM products p INNER JOIN transactions_1k t ON p.ProductID = t.ProductID INNER JOIN yearmonth ym ON t.CustomerID = ym.CustomerID WHERE ym.Date = '2013-09-01';\t----- bird -----\tdebit_card_specializing",
 '15': "SELECT Country FROM gasstations WHERE GasStationID IN (SELECT GasStationID FROM transactions_1k WHERE Date = '2013-06-01' AND Time BETWEEN '00:00:00' AND '23:59:59');\t----- bird -----\tdebit_card_specializing",
 '16': 'SELECT COUNT(DISTINCT c.CustomerID) AS Count FROM customers c INNER JOIN "transactions_1k" t ON c.CustomerID = t.CustomerID INNER JOIN "yearmonth" y ON c.CustomerID = y.CustomerID WHERE c.Currency = \'EUR\' AND y.Consumption > 1000;\t----- bird -----\tdebit_card_specializing',
 '17': "SELECT p.Description FROM transactions_1k t INNER JOIN gasstations g ON t.GasStationID = g.GasStationID INNER JOIN customers c ON t.CustomerID = c.CustomerID INNER JOIN products p ON t.ProductID = p.ProductID WHERE g.Country = 'Czech Republic';\t----- bird -----\tdebit_card_specializing",
 '18': 'WITH Chain11 AS (SELECT GasStationID FROM gasstations WHERE ChainID = 11) SELECT TransactionID FROM transactions_1k WHERE GasStationID IN (SELECT GasStationID FROM Chain11);\t----- bird -----\tdebit_card_specializing',
 '19': "SELECT COUNT(*) FROM transactions_1k WHERE GasStationID IN (SELECT GasStationID FROM gasstations WHERE Country = 'Czech Republic') AND Date > '2012-01-01';\t----- bird -----\tdebit_card_specializing",
 '20': "SELECT Currency FROM transactions_1k WHERE Date = '2012-08-24' AND Time = '16:25:00';\t----- bird -----\tdebit_card_specializing",
 '21': "SELECT c.Segment FROM customers c INNER JOIN transactions_1k t ON c.CustomerID = t.CustomerID WHERE t.Date = '2012/8/23' AND t.Time = '21:20:00';\t----- bird -----\tdebit_card_specializing",
 '22': "SELECT COUNT(*) FROM transactions_1k WHERE Date = '2012-08-26' AND Time BETWEEN '08:00:00' AND '09:00:00' AND Country = 'CZE';\t----- bird -----\tdebit_card_specializing",
 '23': 'SELECT c.Country FROM customers c JOIN transactions_1k t ON c.CustomerID = t.CustomerID WHERE t.TransactionID = 100000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000\t----- bird -----\tdebit_card_specializing',
 '24': "SELECT COUNT(DISTINCT CustomerID) AS TotalCustomers FROM customers WHERE Currency = 'EUR' AND YEAR(Date) = 2012 AND MONTH(Date) = 8 AND DAY(Date) = 25; WITH Percentage AS (SELECT COUNT(DISTINCT CustomerID) AS TotalCustomers FROM customers WHERE Currency = 'EUR' AND YEAR(Date) = 2012 AND MONTH(Date) = 8 AND DAY(Date) = 25) SELECT (SELECT COUNT(DISTINCT CustomerID) AS TotalCustomers FROM customers WHERE Currency = 'EUR' AND YEAR(Date) = 2012 AND MONTH(Date) = 8 AND DAY(Date) = 25) / (SELECT COUNT(DISTINCT CustomerID) AS TotalCustomers FROM customers) * 100 AS Percentage FROM customers;\t----- bird -----\tdebit_card_specializing",
 '25': "WITH YearlyConsumption AS (SELECT CustomerID, SUM(Consumption) as TotalConsumption FROM yearmonth GROUP BY CustomerID) SELECT (TotalConsumption[2013] - TotalConsumption[2012])/(TotalConsumption[2012] - 634.8) * 100 FROM YearlyConsumption WHERE CustomerID = (SELECT CustomerID FROM transactions_1k WHERE Date = '2012-08-25' AND Amount = 634.8);\t----- bird -----\tdebit_card_specializing",
 '26': "WITH PremiumSegment AS (SELECT * FROM customers WHERE Segment = 'Premium'), TotalSegment AS (SELECT * FROM customers WHERE Segment IS NOT NULL), TotalPremium AS (SELECT COUNT(*) FROM PremiumSegment), TotalCustomers AS (SELECT COUNT(*) FROM TotalSegment), Percentage AS (SELECT (TotalPremium/TotalCustomers)*100 FROM TotalPremium, TotalCustomers) SELECT Percentage FROM Percentage WHERE Country = 'SVK';\t----- bird -----\tdebit_card_specializing",
 '27': "SELECT SUM(Amount) FROM transactions_1k WHERE CustomerID = 38508; SELECT SUM(Consumption) FROM yearmonth WHERE CustomerID = 38508 AND Date = '2012-01-01';\t----- bird -----\tdebit_card_specializing",
 '28': 'WITH RankedCustomers AS (SELECT CustomerID, SUM(Amount) AS TotalSpending, DENSE_RANK() OVER (ORDER BY SUM(Amount) DESC) AS Rank FROM transactions_1k GROUP BY CustomerID) SELECT CustomerID, TotalSpending, AVG(Amount) AS AvgPricePerItem, Currency FROM RankedCustomers JOIN customers ON RankedCustomers.CustomerID = customers.CustomerID WHERE Rank = 1;\t----- bird -----\tdebit_card_specializing',
 '29': 'SELECT c.CustomerID, y.Consumption FROM "transactions_1k" t INNER JOIN customers c ON t.CustomerID = c.CustomerID INNER JOIN products p ON t.ProductID = p.ProductID WHERE p.ProductID = 5 AND t.Amount > 29.00 INNER JOIN yearmonth y ON y.CustomerID = c.CustomerID AND y.Date = \'2012-08\';\t----- bird -----\tdebit_card_specializing',
 '30': "SELECT major_name FROM major WHERE major_id = (SELECT link_to_major FROM member WHERE member_id = 'Angela Sanders');\t----- bird -----\tstudent_club",
 '31': "SELECT COUNT(*) FROM member WHERE member_id IN (SELECT link_to_member FROM attendance WHERE event_id = 'Women_Soccer') AND t_shirt_size = 'medium';\t----- bird -----\tstudent_club",
 '32': "WITH AttendedEvents AS (SELECT e.event_id, COUNT(DISTINCT a.link_to_member) AS MemberCount FROM event e INNER JOIN attendance a ON e.event_id = a.link_to_event WHERE a.link_to_member IS NOT NULL GROUP BY e.event_id), MeetingEvents AS (SELECT event_id FROM event WHERE type = 'Meeting') SELECT COUNT(*) FROM AttendedEvents WHERE event_id IN (SELECT event_id FROM MeetingEvents) AND MemberCount > 10;\t----- bird -----\tstudent_club",
 '33': "SELECT event_name FROM event WHERE event_id IN (SELECT link_to_event FROM attendance WHERE COUNT(*) > 20) AND type != 'Fundraiser';\t----- bird -----\tstudent_club",
 '34': "SELECT SUM(amount) FROM income WHERE link_to_member = (SELECT member_id FROM member WHERE position = 'Vice President');\t----- bird -----\tstudent_club",
 '35': "SELECT m.first_name, m.last_name FROM member m INNER JOIN zip_code z ON m.zip = z.zip_code WHERE z.state = 'Illinois';\t----- bird -----\tstudent_club",
 '36': "SELECT e.event_name, e.event_date, e.type, e.notes, e.location, e.status, a.link_to_member, b.expense_id, b.expense_description, b.expense_date, b.cost, b.approved FROM event e INNER JOIN attendance a ON e.event_id = a.link_to_event INNER JOIN expense b ON a.link_to_member = b.link_to_member WHERE e.event_name = 'October Meeting' AND e.event_date = '2019-10-08' AND b.expense_date = '2019-10-08' AND b.approved = 'Yes';\t----- bird -----\tstudent_club",
 '37': "SELECT AVG(e.cost) as avg_cost FROM expense e WHERE e.approved = 'Yes' AND e.expense_date BETWEEN '2022-09-01' AND '2022-10-31' AND e.link_to_member = 'elijahallen';\t----- bird -----\tstudent_club",
 '38': "SELECT SUM(CASE WHEN YEAR(event_date) = 2019 THEN amount ELSE 0 END) - SUM(CASE WHEN YEAR(event_date) = 2020 THEN amount ELSE 0 END) AS TotalDifference FROM budget WHERE link_to_event IN (SELECT event_id FROM event WHERE YEAR(event_date) BETWEEN 2019 AND 2020) AND event_status = 'Approved' AND category = 'Student_Club';\t----- bird -----\tstudent_club",
 '39': "SELECT notes FROM event WHERE event_date = '2019/9/14';\t----- bird -----\tstudent_club",
 '40': "SELECT phone FROM member WHERE member_id = 'Carlo Jacobs';\t----- bird -----\tstudent_club",
 '41': "SELECT status FROM event WHERE event_name = 'Post Cards, Posters' AND event_date = '2019/8/20';\t----- bird -----\tstudent_club",
 '42': "SELECT m.major_name FROM member m WHERE m.member_id = 'Brent Thomason';\t----- bird -----\tstudent_club",
 '43': "SELECT COUNT(*) FROM member WHERE major_id IN (SELECT major_id FROM major WHERE major_name = 'Business') AND t_shirt_size = 'medium';\t----- bird -----\tstudent_club",
 '44': "SELECT department FROM major WHERE major_id = (SELECT link_to_major FROM member WHERE member_id = (SELECT link_to_member FROM attendance WHERE link_to_event = (SELECT event_id FROM event WHERE event_name = 'President of the Club')));\t----- bird -----\tstudent_club",
 '45': "SELECT date_received FROM income WHERE link_to_member = 'Connor Hilton';\t----- bird -----\tstudent_club",
 '46': "SELECT COUNT(*) FROM budget WHERE category = 'Advertisement' AND link_to_event = 'Yearly Kickoff' - COUNT(*) FROM budget WHERE category = 'Advertisement' AND link_to_event = 'October Meeting'\t----- bird -----\tstudent_club",
 '47': "SELECT SUM(e.cost) as TotalCost FROM event e INNER JOIN expense ee ON e.event_id = ee.link_to_event WHERE ee.expense_description = 'pizza';\t----- bird -----\tstudent_club",
 '48': "SELECT COUNT(DISTINCT city) FROM zip_code WHERE county = 'Orange County' AND state = 'Virginia';\t----- bird -----\tstudent_club",
 '49': "SELECT m.major_name FROM member m WHERE m.phone = '809-555-3360';\t----- bird -----\tstudent_club",
 '50': "SELECT COUNT(*) FROM attendance WHERE link_to_event = 'Women''s Soccer';\t----- bird -----\tstudent_club",
 '51': "SELECT m.member_id, m.first_name, m.last_name FROM member m INNER JOIN major mj ON m.link_to_major = mj.major_id WHERE mj.department = 'School of Applied Sciences, Technology and Education';\t----- bird -----\tstudent_club",
 '52': "WITH Ratio AS (SELECT e.event_id, (SUM(b.spent) - SUM(e.income)) AS TotalSpend, e.budget AS TotalBudget FROM event e JOIN budget b ON e.event_id = b.link_to_event WHERE e.status = 'Closed' GROUP BY e.event_id) SELECT event_id, TotalSpend/TotalBudget AS SpendToBudgetRatio FROM Ratio ORDER BY TotalSpend/TotalBudget DESC LIMIT 1;\t----- bird -----\tstudent_club",
 '53': 'SELECT MAX(spent) as MaxBudget FROM budget;\t----- bird -----\tstudent_club',
 '54': "SELECT SUM(cost) as total_amount FROM expense WHERE expense_description = 'Food';\t----- bird -----\tstudent_club",
 '55': 'SELECT m.first_name, m.last_name FROM member m INNER JOIN attendance a ON m.member_id = a.link_to_member WHERE COUNT(a.link_to_event) > 7;\t----- bird -----\tstudent_club',
 '56': "SELECT m.first_name, m.last_name FROM member m INNER JOIN budget b ON m.member_id = b.link_to_member WHERE b.event_status = 'Yearly Kickoff' AND b.category = 'Budget Manager';\t----- bird -----\tstudent_club",
 '57': 'SELECT event_id FROM budget WHERE amount = (SELECT MIN(amount) FROM budget)\t----- bird -----\tstudent_club',
 '58': "SELECT (SUM(CASE WHEN event_name = 'Yearly Kickoff' THEN cost ELSE 0 END) / SUM(cost)) * 100 AS Yearly_Kickoff_Percentage FROM budget;\t----- bird -----\tstudent_club",
 '59': "SELECT source, SUM(amount) as total FROM income WHERE date_received LIKE '2019-09%' GROUP BY source ORDER BY total DESC LIMIT 1;\t----- bird -----\tstudent_club",
 '60': "SELECT COUNT(*) FROM member WHERE link_to_major = 'Physics Teaching';\t----- bird -----\tstudent_club",
 '61': "SELECT event_name FROM event INNER JOIN budget ON event.event_id = budget.link_to_event WHERE category = 'Advertisement' ORDER BY spent DESC LIMIT 1;\t----- bird -----\tstudent_club",
 '62': "SELECT * FROM attendance WHERE link_to_event = 'Women''s Soccer' AND link_to_member = 'Maya Mclean';\t----- bird -----\tstudent_club",
 '63': "SELECT SUM(cost) FROM expense WHERE expense_description = 'September Speaker Posters';\t----- bird -----\tstudent_club",
 '64': "WITH ExceededBudget AS (SELECT event_id, SUM(spent) AS TotalCost FROM budget WHERE event_status = 'Closed' GROUP BY event_id), RankedEvents AS (SELECT event_id, TotalCost, DENSE_RANK() OVER (ORDER BY TotalCost DESC) AS Rank FROM ExceededBudget) SELECT event_name FROM event WHERE event_id IN (SELECT event_id FROM RankedEvents WHERE Rank = 1);\t----- bird -----\tstudent_club",
 '65': "SELECT SUM(CASE WHEN e.type = 'Expense' THEN e.cost ELSE 0 END) AS TotalExpense FROM event e INNER JOIN expense ee ON e.event_id = ee.link_to_event WHERE e.event_name = 'October Meeting';\t----- bird -----\tstudent_club",
 '66': "SELECT SUM(amount) AS TotalBudget FROM budget WHERE event_status = 'April Speaker'; WITH RankedCategories AS (SELECT category, amount, DENSE_RANK() OVER (ORDER BY amount) AS Rank FROM budget WHERE event_status = 'April Speaker') SELECT category, amount FROM RankedCategories WHERE Rank <= 5;\t----- bird -----\tstudent_club",
 '67': "SELECT SUM(cost) as TotalExpense FROM expense WHERE expense_date = '8/20/2019';\t----- bird -----\tstudent_club",
 '68': "SELECT member.first_name, member.last_name, SUM(expense.cost) AS TotalCost FROM member INNER JOIN expense ON member.member_id = expense.link_to_member WHERE member.member_id = 'rec4BLdZHS2Blfp4v' GROUP BY member.first_name, member.last_name;\t----- bird -----\tstudent_club",
 '69': "SELECT e.expense_description FROM expense e WHERE e.link_to_member = 'Sacha Harrison';\t----- bird -----\tstudent_club",
 '70': "SELECT category FROM event WHERE location = 'MU 215';\t----- bird -----\tstudent_club",
 '71': "SELECT m.last_name, m.position, d.department, c.college FROM member m INNER JOIN major mj ON m.link_to_major = mj.major_id INNER JOIN department d ON mj.department = d.department INNER JOIN college c ON d.college = c.college WHERE mj.major_name = 'Environmental Engineering';\t----- bird -----\tstudent_club",
 '72': "SELECT b.category, e.type FROM budget b INNER JOIN event e ON b.link_to_event = e.event_id WHERE e.location = 'MU 215' AND b.spent = 0;\t----- bird -----\tstudent_club",